Revit 2027 API
BuiltInFailures.CopyPasteFailures.CopyImposterLightError Property
 Light source cannot be copied!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CopyImposterLightError { get; }
Public Shared ReadOnly Property CopyImposterLightError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CopyImposterLightError {
	FailureDefinitionId^ get ();
}
static member CopyImposterLightError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace